package com.sima.dms.tools;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class TextNormalized {
    static List<String> words = Arrays.asList(

            "موجودی", "وارداتی", "گیرنده", "مشترک", "شناسنامه", "ریال", "مجرد",
            "اینجانبان", "ملی", "مالک", "چین", "بایگان", "تلفن", "کارمزد", "ماه",
            "دور نویس", "داران", "تکمیل", "آلات", "منشا", "کارت", "شبا", "کننده",
            "لیر", "واحد", "پروفرمای", "مشتری", "نامبردگان", "شماره", "وزارت", "بارنامه",
            "فرستنده", "اختصاصی", "طبقه", "تصویب", "تاهل", "خارجی", "علت", "وضعیت", "مبالغ",
            "بدهی", "خانوادگی", "و", "سلسه", "روپیه", "مشمول", "الباقی", "ذینفعان", "عنوان",
            "سر", "عوارض", "بدهکار", "انداز", "سوئیفت", "تعداد", "پلاک", "تامین", "آن", "رمز",
            "بازرگانی", "رسید", "اقتصادی", "صاحبان", "مالکیت", "مرکزی", "متن", "ثانویه", "پاراف", "وزن",
            "کره", "قسمت", "بانک", "غیر", "صحت", "ساعت", "شعبه", "اصلی", "صرافی", "دولتی", "ریئیس", "ذینفع",
            "بابت", "برگه", "کد", "درهم", "است", "ایران", "اعتبار", "انقضا", "کل", "خیابان", "اتباع", "متعهدین"
            , "بند", "رهن", "مبلغ", "مقررات", "حقوقی", "امضا", "وارسی", "قطعه", "ملکی", "مقدار", "التفاوت",
            "درخواستی", "مشخصات", "یا", "متقاضی", "شخص", "روسیه", "مورخ", "فیش", "خواهشمند", "تاخیر", "پدر",
            "بندی", "واریز", "مشارکت", "مقصد", "تقاضا", "پایا", "معاون", "مسئول", "الذکر", "کذاران", "یورو",
            "پستی", "ملاحظات", "صادر", "چاپی", "متعهد", "کاربر", "وثیقه", "هند", "موسسه", "مدیریت", "گذار",
            "فرعی", "پایه", "ذیل", "مجموع", "انتقالات", "بانکدار", "بین", "بستانکار", "مجوز", "فرزند", "مجاز",
            "کوتاه مدت", "صاحب", "شرح", "ساتنا", "بسته", "گزارش", "سازمان", "خریدار", "ماشین", "شناسه", "وون",
            "ابطال", "مبدا", "اختیاری", "نشانی", "اساسی", "بنده", "پس", "بهادار", "ترکیه", "دستورالعمل", "روبل", "حروف"
            , "انضمام", "وی", "اظهارنامه", "ابزار", "صفحه", "تایید", "امارات", "طرفین", "ادارات", "متاهل", "منوط",
            "تعرفه", "افتتاحیه", "اوزاق", "نامبرده", "الحسنه", "تاریخ", "دفعات", "پرداخت", "عدد", "عمان", "کشور",
            "مابه", "ابیان", "یوان", "تولیدی", "مبنای", "مهر", "جمع", "تمدید", "نام", "فاکس", "صنعتی","ارزیابی"
            , "پول", "ب.ظ", "سریال", "ملک", "معامله","مستندات", "تحویلی", "ترخیصیه", "کلوز", "تصدیق", "تهیه", "فاکتور تامین", "قرض"
    );

    public static String filterSentence(String sentence) {
        List<String> sentenceWords = new ArrayList<>(Arrays.asList(sentence.split("\\s+")));
        sentenceWords.removeAll(words);
        return String.join(" ", sentenceWords);
    }

}
